import type { Translations } from '@/locales/en';

export const v_003_004_000: Translations['changelog']['entries']['v_003_004_000'] = {
  perf_dependency_updates:
    'Оновлено частину пакетів для забезпечення максимального рівня безпеки та швидкодії додатку.',
  ui_about_me_section:
    'На цільовій сторінці з’явився блок "Про мене", де я вперше розповідаю про себе, щоб познайомити тебе з творцем цього проекту особисто.',
  ui_faq_accordion_section:
    'Для швидкої допомоги на головній сторінці розміщено зручний блок частих запитань та відповідей.',
};
