import type { Translations } from '@/locales/en';

export const v_001_001_000: Translations['changelog']['entries']['v_001_001_000'] = {
  feat_ats_friendly: 'Забезпечено дружній до ATS формат для згенерованих файлів PDF',
  feat_github_backup:
    'При відправленні на GitHub (з вкладки попереднього перегляду) твоя конфігурація також оновиться відповідно до поточного стану',
  feat_mock_data_preview:
    'Якщо дані не вказано, для заповнення шаблонів попереднього перегляду використовуватимуться демонстраційні дані, що дозволить тобі одразу побачити прев’ю',
  feat_onboarding_flow: 'Покращено процес адаптації завдяки оновленому вітальному кроку',
  fix_link_references: 'Оптимізовано кілька посилань у темах PDF та HTML',
  fix_lunar_sidebar_header: 'Заголовки бічної панелі тепер коректно відображаються у темі Lunar',
  fix_netlify_routing: 'Оновлення підсторінок на Netlify більше не викликає помилку 404',
  fix_welcome_modal_scroll: 'Вітальне модальне вікно тепер можна прокручувати на менших екранах',
};
