import type { Translations } from '@/locales/en';

export const v_003_003_002: Translations['changelog']['entries']['v_003_003_002'] = {
  fix_profile_image_borders:
    'Рамките на профилните снимки вече се актуализират правилно при промяна на цветовете на автобиографията, осигурявайки напълно хармоничен изглед във всички палитри.',
  ui_cloud_restore_loader:
    'Вече се показва плавен зареждащ екран по време на възстановяването на архивни копия от облака, осигуряващ ясна обратна връзка до пълното зареждане на данните ти.',
  ui_drive_permission_modal:
    'Предупредителният прозорец за разрешение за Достъп вече се показва правилно, ако липсва достъп до Google Drive при отваряне на избора на автобиография, като те насочва лесно да дадеш разрешение.',
};
