import type { Translations } from '@/locales/en';

export const v_001_001_000: Translations['changelog']['entries']['v_001_001_000'] = {
  feat_ats_friendly: 'Осигурен е формат, удобен за ATS, за генерираните PDF файлове',
  feat_github_backup:
    'При изпращане към GitHub (от раздела за преглед) твоята конфигурация също ще бъде актуализирана според текущото състояние',
  feat_mock_data_preview:
    'Ако не са предоставени данни, ще бъдат използвани фалшиви данни за попълване на шаблоните за преглед, което ти позволява да видиш прегледа веднага',
  feat_onboarding_flow: 'Подобрено преживяване при адаптиране с оптимизиран поток на приветствие',
  fix_link_references: 'оптимизирани са няколко препратки към връзки в PDF и HTML теми',
  fix_lunar_sidebar_header:
    'Коригиран е проблем, при който заглавията на страничната лента не се показваха в темата Lunar',
  fix_netlify_routing:
    'Коригиран е проблем, при който опресняването на подстраници в Netlify водеше до грешка 404',
  fix_welcome_modal_scroll:
    'Коригиран е проблем, при който приветственият модал не можеше да се превърта на по-малки екрани',
};
