import type { Translations } from '@/locales/en';

export const v_003_003_000: Translations['changelog']['entries']['v_003_003_000'] = {
  _highlights: {
    blog: {
      badge: 'Блог',
      content:
        'Изучай в блоге практические идеи и советы по подаче заявок, которые помогут тебе представить себя более заметно, ясно и убедительно. Кроме того, ты найдешь личное видение и истории из-за кулис, которые определяют развитие KiwiCV.',
      title: 'Экспертные знания для твоей карьеры',
    },
    landing: {
      badge: 'Лендинг',
      content:
        'Открой для себя весь потенциал KiwiCV через потрясающий новый интерфейс, демонстрирующий мощные возможности.',
      title: 'Новый интерфейс лендинга',
    },
  },
  feat_expert_blog:
    'Экспертный блог KiwiCV. Новое специальное пространство для профессиональных советов по карьере, советов по составлению резюме и обновлений платформы, которые помогут тебе уверенно идти по карьерному пути.',
  feat_reimagined_landing:
    'Полностью обновленная целевая страница. Открой для себя весь потенциал KiwiCV с помощью нового потрясающего интерфейса, демонстрирующего мощные функции и предоставляющего экспертные советы по созданию современных резюме.',
  fix_stale_ai_suggestions:
    'Предыдущие рекомендации по улучшению теперь автоматически удаляются при импорте или восстановлении нового резюме, что гарантирует актуальность твоего рабочего пространства и его ориентацию на текущие данные.',
  perf_general_optimizations:
    'Множество внутренних оптимизаций обеспечивают еще более плавную работу приложения, дополнительно улучшая процесс создания резюме.',
  ui_smartphone_experience_refinement:
    'Небольшие изменения, благодаря которым работа со смартфоном становится более естественной, а читаемость на мобильных устройствах — лучше.',
};
