import type { Translations } from '@/locales/en';

export const v_003_003_002: Translations['changelog']['entries']['v_003_003_002'] = {
  fix_profile_image_borders:
    'Рамки фотографий профиля теперь корректно обновляются при изменении цветовой схемы резюме, что обеспечивает гармоничный вид во всех палитрах.',
  ui_cloud_restore_loader:
    'При восстановлении резервных копий из облака теперь отображается плавная анимация загрузки, обеспечивая понятную визуальную обратную связь до полного импорта данных.',
  ui_drive_permission_modal:
    'Окно предупреждения о разрешениях Диска теперь корректно отображается при отсутствии доступа к Google Диску во время перехода к выбору резюме, помогая легко предоставить доступ.',
};
