import type { Translations } from '@/locales/en';

export const v_001_001_000: Translations['changelog']['entries']['v_001_001_000'] = {
  feat_ats_friendly: 'Обеспечен формат, дружественный к ATS, для сгенерированных PDF-файлов',
  feat_github_backup:
    'При отправке в GitHub (с вкладки предварительного просмотра) твоя конфигурация также будет обновлена в соответствии с текущим состоянием',
  feat_mock_data_preview:
    'Если данные не предоставлены, для заполнения шаблонов предварительного просмотра будут использоваться мок-данные, что позволит тебе сразу увидеть результат',
  feat_onboarding_flow: 'Улучшен процесс онбординга с оптимизированным приветственным сценарием',
  fix_link_references: 'оптимизировано несколько ссылок в темах PDF и HTML',
  fix_lunar_sidebar_header:
    'Исправлена ошибка, из-за которой заголовки боковой панели не отображались в теме Lunar',
  fix_netlify_routing:
    'Исправлена ошибка, из-за которой обновление подстраниц на Netlify приводило к ошибке 404',
  fix_welcome_modal_scroll:
    'Исправлена ошибка, из-за которой приветственное окно не прокручивалось на маленьких экранах',
};
