import type { Translations } from '@/locales/en';

export const v_003_004_000: Translations['changelog']['entries']['v_003_004_000'] = {
  perf_dependency_updates:
    'Обновлены некоторые пакеты для постоянного поддержания безопасности и производительности на актуальном уровне.',
  ui_about_me_section:
    'В новом разделе «Обо мне» на целевой странице я впервые представляюсь, чтобы тебе было проще узнать человека, стоящего за этим проектом.',
  ui_faq_accordion_section:
    'На целевой странице появился раздел FAQ, который уже содержит ответы на самые частые вопросы.',
};
